import {Component, OnInit, ViewEncapsulation} from '@angular/core';

@Component({
  selector: 'app-header',
  templateUrl: './header.component.html',
  styleUrls: ['./header.component.css']
})
export class HeaderComponent implements OnInit {

  allCategory = [];

  constructor() {
  }

  ngOnInit() {
    this.allCategory = [
      { id: 1, name: 'Дитяча література', subcategory: ['Блокноти', 'Дошкільна', 'Енциклопедії', 'Ігри', 'Підліткова', 'Розмальовки, наклейки, наліпки'] },
      { id: 2, name: 'Календарі' },
      { name: 'Картографічна продукція',  subcategory: ['Енциклопедії країн світу', 'Карти', 'Карти доріг та споруд'] },
      { name: 'Мініатюра' },
      { name: 'Мистецтво', subcategory: ['Досуг', 'Малювання'] },
      { name: 'Музична література', subcategory: ['Збірники пісень', 'Нотна продукція'] },
      { name: 'ПДР'},
      { name: 'Право', subcategory: ['Закони', 'Кодекси', 'Коментарі', 'Посібники'] },
      { name: 'Психологія', subcategory: ['Класики психології', 'Мотивація', 'Психоаналіз', 'Психологія',
          'Психологія світу', 'Психотерапія', 'Релігії світу', 'Самореалізація', 'Світові бестселери'] },
      { name: 'Художня література', subcategory: ['Детективи', 'Класика', 'Різне', 'Сучасна література', 'Українська література', 'Фантастика'] },
      { name: 'Дозвілля', subcategory: ['Бойові мистецтва', 'Кулінарія', 'Культура', 'Рибалка', 'Садівництво', 'Спорт'] },
      { name: 'Історія', subcategory: ['Історія світу', 'Історія України'] },
      { name: 'Книги українських письменників'},
      { name: 'Медицина'},
      { name: 'Навчально-методична література', subcategory: ['Дитяча навчальна', 'Ділове мовлення', 'Довідник (тести)', 'ЗНО', 'Методички', 'Правописи', 'Словники', 'Учбова'] },
      { name: 'Публіцистика', subcategory: ['Біографії', 'Географія, історія'] }
    ];
  }
}
